static/presentations/2019-03-27/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>GRO-Seq</title>
<meta name="author" content="(Edmund Miller)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/css/theme/white.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-orgc6edb84">
<h2 id="orgc6edb84">GRO-Seq Analysis</h2>
<div class="outline-text-2" id="text-orgc6edb84">
</div>
</section>
</section>
<section>
<section id="slide-org27b2dde">
<h3 id="org27b2dde">Recap</h3>
<ul>
<li>Predicted IMR90 eRNAs</li>
<li>Compared IMR90 Predicted Enhancers to GM</li>
<li>Ran GREAT Analysis on them</li>
<li>Used Homer builtin scripts to find DE of eRNAs and Genes</li>

</ul>
</section>
</section>
<section>
<section id="slide-org60f567f">
<h3 id="org60f567f">What I&rsquo;ve been working on</h3>
<div class="outline-text-3" id="text-org60f567f">
</div>
</section>
<section id="slide-org9dd2679">
<h4 id="org9dd2679">Gene Centric vs. Enhancer Centric</h4>
<ul>
<li>Peng&rsquo;s approach
<ul>
<li>Took enhancers that were expressed deferentially</li>
<li>Linked them to Genes within 200Kb</li>

</ul></li>
<li>New approach
<ul>
<li>Take genes that are deferentially expressed</li>
<li>Link the Enhancers to those genes</li>

</ul></li>

</ul>
</section>
<section id="slide-org0fb15b1">
<h4 id="org0fb15b1">Gene Differenitial Expression</h4>
</section>
<section id="slide-org1d41634" data-background="viz/pipeline.png" data-background-size="800px" data-background-transition="slide">
<h4 id="org1d41634"></h4>
</section>
<section id="slide-orgb89bb42">
<h4 id="orgb89bb42">featureCounts</h4>
<div class="outline-text-4" id="text-orgb89bb42">
</div>
<ul class="org-ul">
<li><a id="orge52087a"></a>Tried CLI version<br /></li>
<li><a id="orgcb2bfd1"></a>Couldn&rsquo;t get examples to work with edgeR<br /></li>
<li><a id="orgc07c05e"></a>Switched to R package<br /></li>
</ul>
</section>
<section id="slide-org967c8be">
<h4 id="org967c8be">edgeR</h4>
<div class="outline-text-4" id="text-org967c8be">
</div>
<ul class="org-ul">
<li><a id="orgc8ef5f4"></a>Error with exactTest<br /></li>
<li><a id="orga7be906"></a>Defaulted to writing raw DGEList to file<br /></li>
<li><a id="orgb17c238"></a>Used in Pivot<br /></li>
</ul>
</section>
</section>
<section>
<section id="slide-org24e345d">
<h3 id="org24e345d">Results</h3>
<div class="outline-text-3" id="text-org24e345d">
</div>
</section>
<section id="slide-orgecdbb49" data-background="img/GM_normalized.png" data-background-size="1200px" data-background-transition="slide">
<h4 id="orgecdbb49"></h4>
</section>
<section id="slide-orge2b88c5" data-background="img/IMR_normalized.png" data-background-size="1200px" data-background-transition="slide">
<h4 id="orge2b88c5"></h4>
</section>
</section>
<section>
<section id="slide-orgb5a8e3d">
<h3 id="orgb5a8e3d">Future</h3>
<div class="outline-text-3" id="text-orgb5a8e3d">
</div>
</section>
<section id="slide-org6f02b27">
<h4 id="org6f02b27">Future</h4>
<div class="outline-text-4" id="text-org6f02b27">
</div>
<ul class="org-ul">
<li><a id="org1a4eb54"></a>Compare IMR and GM Genes<br /></li>
<li><a id="orgfd9f7b0"></a>Get List of Top Genes<br /></li>
<li><a id="orgae2c457"></a>Link eRNAs and Top genes<br /></li>
<li><a id="org14954d2"></a>Kinetics of the eRNAs<br /></li>
</ul>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
